W5/D1_AdamBerkovec/goal_app/app/controllers/goals_controller.rb

INSERT INTO "goals" ("title", "details", "private_goal", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dxzgn"], ["details", "  cxcnxcn"], ["private_goal", "t"], ["user_id", 2], ["created_at", "2015-01-13 00:39:03.021609"], ["updated_at", "2015-01-13 00:39:03.021609"]]
---
  def create
    @goal = Goal.new(goal_params)
    @goal.user_id = current_user.id

    if @goal.save

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "goals" SET "details" = $1, "completed" = $2, "updated_at" = $3 WHERE "goals"."id" = $4  [["details", "     adfAdgSDGSDgSDSDgSDgSdgs   "], ["completed", "t"], ["updated_at", "2015-01-13 01:49:23.281900"], ["id", 1]]
---
  def update
    @goal = Goal.find(params[:id])

    if @goal.update(goal_params)

SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]
---
  def destroy
    @goal = Goal.find(params[:id])

    id = @goal.user_id
    @goal.destroy