W5/D1_AdamBerkovec/goal_app/app/controllers/sessions_controller.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "bbec5e8c25934480adf4a21b754b83ba"], ["updated_at", "2015-01-12 21:51:54.317252"], ["id", 1]]
---
  def create
    #WRITE FIND BY CREDENTIUALS AND LOGIN
    @user = User.find_by_credentials(
      params[:user][:username],
      params[:user][:password]
    )
    if @user.save