W5/D1_AdamBerkovec/goal_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "goals".* FROM "goals" WHERE "goals"."user_id" = $1 LIMIT 1  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @goals = Goal.all.where(user_id: params[:id])